<template>
    <div>
        <md-app-content>
            <div class="breadcrumbs">
                <div class="breadcrumbs__item">
                    <p class="breadcrumbs__item-large">Сообщения</p>
                    <breadcrumbs/>
                </div>
            </div>
        </md-app-content>
        <md-card>
            <md-card-content>
                <section class="dialogs-container">
                    <div class="dialogs-container__search">
                        <input type="search" placeholder="🔍    Поиск">
                    </div>
                    <div class="dialogs-container__dialog">
                        <div class="dialog__avatar">
                            <img src="../assets/images/person.svg" alt="avatar">
                        </div>
                        <div class="dialog__name">Мария Ивановна</div>
                        <div class="dialog__role">
                            <div>Продавец</div>
                        </div>
                    </div>
                    <div class="dialogs-container__dialog">
                        <div class="dialog__avatar">
                            <img src="../assets/images/person.svg" alt="avatar">
                        </div>
                        <div class="dialog__name">Мария Ивановна</div>
                        <div class="dialog__role">
                            <div>Менеджер</div>
                        </div>
                    </div>
                    <div class="dialogs-container__dialog">
                        <div class="dialog__avatar">
                            <img src="../assets/images/person.svg" alt="avatar">
                        </div>
                        <div class="dialog__name">Мария Ивановна</div>
                        <div class="dialog__role">
                            <div>Продавец</div>
                        </div>
                    </div>
                </section>
                <section class="dialog">
                    <div class="dialog__window">
                        <div class="message">
                            <div class="message__avatar">
                                <img src="../assets/images/person.svg">
                            </div>
                            <div class="message__container">
                                <div class="message__data">
                                    <div class="message__name">Мария Ивановна</div>
                                    <div class="message__date">30 ноября 2018</div>
                                </div>
                                <div class="message__text">php уже стал зрелым языком, легким в изучении и работающим на многих платформах. Однако за его гибкость и легкость использования приходится платить системными ресурсами. php, как все интерпретируемые языки, должен перед выполнением компилироваться в код, понятный платформе, на которой работает. Интерпретируемый код может сильно ухудшить производительность, особенно на слабой или перегруженной машине, потому что затрачивается много времени на обработку кода. php скрипт работает достаточно быстро, но не так быстро как заранее скомпилированная программа.</div>
                            </div>
                        </div>
                        <div class="message reverse">
                            <div class="message__avatar">
                                <img src="../assets/images/person.svg">
                            </div>
                            <div class="message__container">
                                <div class="message__data reverse">
                                    <div class="message__name">Мария Ивановна</div>
                                    <div class="message__date">30 ноября 2018</div>
                                </div>
                                <div class="message__text">php уже стал зрелым языком, легким в изучении и работающим на многих платформах. Однако за его гибкость и легкость использования приходится платить системными ресурсами. php, как все интерпретируемые языки, должен перед выполнением компилироваться в код, понятный платформе, на которой работает. Интерпретируемый код может сильно ухудшить производительность, особенно на слабой или перегруженной машине, потому что затрачивается много времени на обработку кода. php скрипт работает достаточно быстро, но не так быстро как заранее скомпилированная программа.</div>
                            </div>
                        </div>
                        <div class="message">
                            <div class="message__avatar">
                                <img src="../assets/images/person.svg">
                            </div>
                            <div class="message__container">
                                <div class="message__data">
                                    <div class="message__name">Мария Ивановна</div>
                                    <div class="message__date">30 ноября 2018</div>
                                </div>
                                <div class="message__text">php уже стал зрелым языком, легким в изучении и работающим на многих платформах. Однако за его гибкость и легкость использования приходится платить системными ресурсами. php, как все интерпретируемые языки, должен перед выполнением компилироваться в код, понятный платформе, на которой работает. Интерпретируемый код может сильно ухудшить производительность, особенно на слабой или перегруженной машине, потому что затрачивается много времени на обработку кода. php скрипт работает достаточно быстро, но не так быстро как заранее скомпилированная программа.</div>
                            </div>
                        </div>
                        <div class="message reverse">
                            <div class="message__avatar">
                                <img src="../assets/images/person.svg">
                            </div>
                            <div class="message__container">
                                <div class="message__data reverse">
                                    <div class="message__name">Мария Ивановна</div>
                                    <div class="message__date">30 ноября 2018</div>
                                </div>
                                <div class="message__text">php уже стал зрелым языком, легким в изучении и работающим на многих платформах. Однако за его гибкость и легкость использования приходится платить системными ресурсами. php, как все интерпретируемые языки, должен перед выполнением компилироваться в код, понятный платформе, на которой работает. Интерпретируемый код может сильно ухудшить производительность, особенно на слабой или перегруженной машине, потому что затрачивается много времени на обработку кода. php скрипт работает достаточно быстро, но не так быстро как заранее скомпилированная программа.</div>
                            </div>
                        </div>
                        <div class="message reverse">
                            <div class="message__avatar">
                                <img src="../assets/images/person.svg">
                            </div>
                            <div class="message__container">
                                <div class="message__data reverse">
                                    <div class="message__name">Мария Ивановна</div>
                                    <div class="message__date">30 ноября 2018</div>
                                </div>
                                <div class="message__text">php уже стал зрелым языком, легким в изучении и работающим на многих платформах. Однако за его гибкость и легкость использования приходится платить системными ресурсами. php, как все интерпретируемые языки, должен перед выполнением компилироваться в код, понятный платформе, на которой работает. Интерпретируемый код может сильно ухудшить производительность, особенно на слабой или перегруженной машине, потому что затрачивается много времени на обработку кода. php скрипт работает достаточно быстро, но не так быстро как заранее скомпилированная программа.</div>
                            </div>
                        </div>
                    </div>
                    <div class="dialog__textarea">
                        <input type="text" placeholder="Напишите сообщение...">
                        <md-button>
                            <md-icon class="fa fa-chevron-right"></md-icon>
                        </md-button>
                    </div>
                </section>
            </md-card-content>
        </md-card>
    </div>
</template>

<script></script>

<style lang="scss"></style>
